//////////////////////////////////////////////////////////////////////////////
//
// ADT k-Priority Queue
//
// Abstract k-ουρά προτεραιότητας, η οποία παρέχει πρόσβαση τόσο στο μέγιστο,
// όσο και στο k-οστό σε διάταξη στοιχείο (για σταθερό k). Η αφαίρεση γίνεται
// στο μέγιστο στοιχείο.
//
//////////////////////////////////////////////////////////////////////////////

#pragma once // #include το πολύ μία φορά

#include "common_types.h"


// Μία k-ουρά προτεραιότητας αναπαριστάται από τον τύπο KPQ

typedef struct kpq* KPQ;


// Δημιουργεί και επιστρέφει μια νέα k-ουρά προτεραιότητας, για το k που δίνεται
// ως όρισμα, της οποίας τα στοιχεία συγκρίνονται με βάση τη συνάρτηση compare.
// Αν destroy_value != NULL, τότε καλείται destroy_value(value) κάθε φορά που αφαιρείται ένα στοιχείο.

KPQ kpq_create(CompareFunc compare, int k, DestroyFunc destroy_value);

// Επιστρέφει τον αριθμό στοιχείων που περιέχει η ουρά kpq

int kpq_size(KPQ kpq);

// Επιστρέφει το μεγαλύτερο στοιχείο της ουράς (μη ορισμένο αποτέλεσμα αν η ουρά είναι κενή)

Pointer kpq_max(KPQ kpq);

// Επιστρέφει το k-οστό μεγαλύτερο στοιχείο της ουράς (μη ορισμένο αποτέλεσμα αν η ουρά είναι λιγότερα από k στοιχεία)

Pointer kpq_k_th(KPQ kpq);

// Προσθέτει την τιμή value στην ουρά kpq.

void kpq_insert(KPQ kpq, Pointer value);

// Αφαιρεί το μεγαλύτερο στοιχείο της ουράς (μη ορισμένο αποτέλεσμα αν η ουρά είναι κενή)

void kpq_remove_max(KPQ kpq);

// Αλλάζει τη συνάρτηση που καλείται σε κάθε αφαίρεση/αντικατάσταση στοιχείου σε
// destroy_value. Επιστρέφει την προηγούμενη τιμή της συνάρτησης.

DestroyFunc kpq_set_destroy_value(KPQ kpq, DestroyFunc destroy_value);

// Ελευθερώνει όλη τη μνήμη που δεσμεύει η ουρά kpq.
// Οποιαδήποτε λειτουργία πάνω στη ουρά μετά το destroy είναι μη ορισμένη.

void kpq_destroy(KPQ kpq);
